# WinderFilletRadiusTooLargeFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderFilletRadiusTooLargeFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The value for Fillet Radius is too large to satisfy the Minimum Inside Width value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderFilletRadiusTooLargeFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderFilletRadiusTooLargeFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderFilletRadiusTooLargeFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace